rhuitl/linux/arch/arm/mach-nuc700/include/mach/mfp-nuc745.h
/*
 * arch/arm/mach-nuc700/include/mach/mfp.h
 *
 * Copyright (c) 2011 Nuvoton technology corporation.
 *
 * Wan ZongShun <mcuos.com@gmail.com>
 *
 * Based on arch/arm/mach-nuc700/include/mach/map.h
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation;version 2 of the License.
 *
 */

#include <mach/mfp.h>

#ifndef __ASM_ARCH_MFP_NUC745_H
#define __ASM_ARCH_MFP_NUC745_H

/*PT0*/

/* GPIO */
#define GPIO0_GPIO0		CFG(0, FN0, GPIO_PT0_OFFSET)
#define GPIO1_GPIO1		CFG(1, FN0, GPIO_PT0_OFFSET)
#define GPIO2_GPIO2		CFG(2, FN0, GPIO_PT0_OFFSET)
#define GPIO3_GPIO3		CFG(3, FN0, GPIO_PT0_OFFSET)
#define GPIO4_GPIO4		CFG(4, FN0, GPIO_PT0_OFFSET)

/* AC97 and I2S, but named by ac97*/
#define GPIO0_AC97_NRESET	CFG(0, FN1, GPIO_PT0_OFFSET)
#define GPIO1_AC97_DATAI	CFG(1, FN1, GPIO_PT0_OFFSET)
#define GPIO2_AC97_DATAO	CFG(2, FN1, GPIO_PT0_OFFSET)
#define GPIO3_AC97_SYNC		CFG(3, FN1, GPIO_PT0_OFFSET)
#define GPIO4_AC97_BITCLK	CFG(4, FN1, GPIO_PT0_OFFSET)

/* IRQ2 */
#define GPIO0_nIRQ2		CFG(0, FN2, GPIO_PT0_OFFSET)

/* PWM */
#define GPIO1_PWM0		CFG(1, FN2, GPIO_PT0_OFFSET)
#define GPIO2_PWM1		CFG(2, FN2, GPIO_PT0_OFFSET)
#define GPIO3_PWM2		CFG(3, FN2, GPIO_PT0_OFFSET)
#define GPIO4_PWM3		CFG(4, FN2, GPIO_PT0_OFFSET)

/* USB PWREN */
#define GPIO0_USB_PWREN		CFG(0, FN3, GPIO_PT0_OFFSET)

/* UART3 */
#define GPIO1_UART_DTR3		CFG(1, FN3, GPIO_PT0_OFFSET)
#define GPIO2_UART_DSR3		CFG(2, FN3, GPIO_PT0_OFFSET)
#define GPIO3_UART_TXD3		CFG(3, FN3, GPIO_PT0_OFFSET)
#define GPIO4_UART_RXD3		CFG(4, FN3, GPIO_PT0_OFFSET)

/*PT1*/

/* GPIO */
#define GPIO18_GPIO18		CFG(0, FN0, GPIO_PT1_OFFSET)
#define GPIO19_GPIO19		CFG(1, FN0, GPIO_PT1_OFFSET)

#define GPIO18_nXDACK		CFG(0, FN2, GPIO_PT1_OFFSET)
#define GPIO19_nXDREQ		CFG(1, FN2, GPIO_PT1_OFFSET)

/*PT2*/

/* GPIO */
#define GPIO20_GPIO20		CFG(0, FN0, GPIO_PT2_OFFSET)
#define GPIO21_GPIO21		CFG(1, FN0, GPIO_PT2_OFFSET)
#define GPIO22_GPIO22		CFG(2, FN0, GPIO_PT2_OFFSET)
#define GPIO23_GPIO23		CFG(3, FN0, GPIO_PT2_OFFSET)
#define GPIO24_GPIO24		CFG(4, FN0, GPIO_PT2_OFFSET)
#define GPIO25_GPIO25		CFG(5, FN0, GPIO_PT2_OFFSET)
#define GPIO26_GPIO26		CFG(6, FN0, GPIO_PT2_OFFSET)
#define GPIO27_GPIO27		CFG(7, FN0, GPIO_PT2_OFFSET)
#define GPIO28_GPIO28		CFG(8, FN0, GPIO_PT2_OFFSET)
#define GPIO29_GPIO29		CFG(9, FN0, GPIO_PT2_OFFSET)

#define GPIO20_PHYRXERR		CFG(0, FN1, GPIO_PT2_OFFSET)
#define GPIO21_PHYCRSDV		CFG(1, FN1, GPIO_PT2_OFFSET)
#define GPIO22_PHYRXD0		CFG(2, FN1, GPIO_PT2_OFFSET)
#define GPIO23_PHYRXD1		CFG(3, FN1, GPIO_PT2_OFFSET)
#define GPIO24_PHYREFCLK	CFG(4, FN1, GPIO_PT2_OFFSET)
#define GPIO25_PHYTXEN		CFG(5, FN1, GPIO_PT2_OFFSET)
#define GPIO26_PHYTXD0		CFG(6, FN1, GPIO_PT2_OFFSET)
#define GPIO27_PHYTXD1		CFG(7, FN1, GPIO_PT2_OFFSET)
#define GPIO28_PHYMDIO		CFG(8, FN1, GPIO_PT2_OFFSET)
#define GPIO29_PHYMDC		CFG(9, FN1, GPIO_PT2_OFFSET)

#define GPIO20_KPCOL0		CFG(0, FN2, GPIO_PT2_OFFSET)
#define GPIO21_KPCOL1		CFG(1, FN2, GPIO_PT2_OFFSET)
#define GPIO22_KPCOL2		CFG(2, FN2, GPIO_PT2_OFFSET)
#define GPIO23_KPCOL3		CFG(3, FN2, GPIO_PT2_OFFSET)
#define GPIO24_KPCOL4		CFG(4, FN2, GPIO_PT2_OFFSET)
#define GPIO25_KPCOL5		CFG(5, FN2, GPIO_PT2_OFFSET)
#define GPIO26_KPCOL6		CFG(6, FN2, GPIO_PT2_OFFSET)
#define GPIO27_KPCOL7		CFG(7, FN2, GPIO_PT2_OFFSET)
#define GPIO28_KPROW0		CFG(8, FN2, GPIO_PT2_OFFSET)
#define GPIO29_KPROW1		CFG(9, FN2, GPIO_PT2_OFFSET)

/*PT3*/
/* reserved by nuc745 */

/*PT4*/

/* GPIO */
#define GPIO30_GPIO30		CFG(0, FN0, GPIO_PT4_OFFSET)
#define GPIO30_nWAIT		CFG(0, FN0, GPIO_PT4_OFFSET)
#define GPIO30_nIRQ3		CFG(0, FN0, GPIO_PT4_OFFSET)

/*PT5*/

/* GPIO */
#define GPIO5_GPIO5		CFG(0, FN0, GPIO_PT5_OFFSET)
#define GPIO6_GPIO6		CFG(1, FN0, GPIO_PT5_OFFSET)
#define GPIO7_GPIO7		CFG(2, FN0, GPIO_PT5_OFFSET)
#define GPIO8_GPIO8		CFG(3, FN0, GPIO_PT5_OFFSET)
#define GPIO9_GPIO9		CFG(4, FN0, GPIO_PT5_OFFSET)
#define GPIO10_GPIO10		CFG(5, FN0, GPIO_PT5_OFFSET)
#define GPIO11_GPIO11		CFG(6, FN0, GPIO_PT5_OFFSET)
#define GPIO12_GPIO12		CFG(7, FN0, GPIO_PT5_OFFSET)
#define GPIO13_GPIO13		CFG(8, FN0, GPIO_PT5_OFFSET)
#define GPIO14_GPIO14		CFG(9, FN0, GPIO_PT5_OFFSET)
#define GPIO15_GPIO15		CFG(10, FN0, GPIO_PT5_OFFSET)
#define GPIO16_GPIO16		CFG(11, FN0, GPIO_PT5_OFFSET)
#define GPIO17_GPIO17		CFG(12, FN0, GPIO_PT5_OFFSET)

#define GPIO5_TXD0		CFG(0, FN1, GPIO_PT5_OFFSET)
#define GPIO6_RXD0		CFG(1, FN1, GPIO_PT5_OFFSET)
#define GPIO7_TXD1		CFG(2, FN1, GPIO_PT5_OFFSET)
#define GPIO8_RXD1		CFG(3, FN1, GPIO_PT5_OFFSET)
#define GPIO9_TXD2		CFG(4, FN1, GPIO_PT5_OFFSET)
#define GPIO10_RXD2		CFG(5, FN1, GPIO_PT5_OFFSET)
#define GPIO11_SCL0		CFG(6, FN1, GPIO_PT5_OFFSET)
#define GPIO12_SDA0		CFG(7, FN1, GPIO_PT5_OFFSET)
#define GPIO13_SCL1		CFG(8, FN1, GPIO_PT5_OFFSET)
#define GPIO14_SDA1		CFG(9, FN1, GPIO_PT5_OFFSET)
#define GPIO15_nWDOG		CFG(10, FN1, GPIO_PT5_OFFSET)
#define GPIO16_nIRQ0		CFG(11, FN1, GPIO_PT5_OFFSET)
#define GPIO17_nIRQ1		CFG(12, FN1, GPIO_PT5_OFFSET)

#define GPIO9_CTS1		CFG(4, FN2, GPIO_PT5_OFFSET)
#define GPIO10_RTS1		CFG(5, FN2, GPIO_PT5_OFFSET)
#define GPIO11_SFRM		CFG(6, FN2, GPIO_PT5_OFFSET)
#define GPIO12_SSPTX		CFG(7, FN2, GPIO_PT5_OFFSET)
#define GPIO13_SSPSCLK		CFG(8, FN2, GPIO_PT5_OFFSET)
#define GPIO14_SSPRXD		CFG(9, FN2, GPIO_PT5_OFFSET)
#define GPIO15_USBPWREN		CFG(10, FN2, GPIO_PT5_OFFSET)
#define GPIO17_USBOVCUR		CFG(12, FN2, GPIO_PT5_OFFSET)

#define GPIO9_PS2CLK		CFG(4, FN3, GPIO_PT5_OFFSET)
#define GPIO10_PS2DATA		CFG(5, FN3, GPIO_PT5_OFFSET)
#define GPIO11_TIMER0		CFG(6, FN3, GPIO_PT5_OFFSET)
#define GPIO12_TIMER1		CFG(7, FN3, GPIO_PT5_OFFSET)
#define GPIO13_KPROW3		CFG(8, FN3, GPIO_PT5_OFFSET)
#define GPIO14_KPROW2		CFG(9, FN3, GPIO_PT5_OFFSET)
/*PT6*/
/* reserved by nuc745 */
#endif /*__ASM_ARCH_MFP_NUC745_H */

